tap "cloudflare/cloudflare"
tap "cue-lang/tap"
tap "dagger/tap"
tap "earthly/earthly"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "int128/kubelogin"
tap "louisbrunner/valgrind"
tap "supabase/tap"
tap "superfly/tap"
tap "teaxyz/pkgs"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Compute various size metrics for a Git repository
brew "git-sizer"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# OpenType text shaping engine
brew "harfbuzz"
# Command-driven, interactive function plotting
brew "gnuplot"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Platform built on V8 to build network applications
brew "node@18"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Kubernetes introspection tool for developers
brew "octant"
# Development kit for the Java programming language
brew "openjdk"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# A kubectl plugin for Kubernetes OpenID Connect authentication
brew "int128/kubelogin/kubelogin"
brew "superfly/tap/flyctl"
# Unified package manager
brew "teaxyz/pkgs/tea-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Two-factor authentication software
cask "authy"
# Server and cloud storage browser
cask "cyberduck"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Single-player fantasy game
cask "dwarf-fortress"
# Control your Elgato key lights
cask "elgato-control-center"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# App to manage software development and track bugs
cask "linear-linear"
# Free and open-source RSS reader
cask "netnewswire"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media server
cask "plex-media-server"
# Collaboration platform for API development
cask "postman"
# HTTP debugging proxy
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redisinsight"
# Remote desktop software
cask "screens-connect"
# Video game digital distribution service
cask "steam"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "Capital One Shopping", id: 1477110326
mas "Chessvision.ai Browser Scanner", id: 1635826532
mas "Core Tunnel", id: 1354318707
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "dkundel.vscode-new-file"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "forbeslindesay.vscode-sql-template-literal"
vscode "ghmcadams.lintlens"
vscode "GitHub.codespaces"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "inercia.vscode-k3d"
vscode "ipedrazas.kubernetes-snippets"
vscode "marp-team.marp-vscode"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "nicoespeon.abracadabra"
vscode "nrwl.angular-console"
vscode "ocamllabs.ocaml-platform"
vscode "Orta.vscode-jest"
vscode "Orta.vscode-twoslash-queries"
vscode "PKief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "ria.elastic"
vscode "rust-lang.rust-analyzer"
vscode "spikespaz.vscode-smoothtype"
vscode "statelyai.stately-vscode"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "vincaslt.highlight-matching-tag"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "ZixuanChen.vitest-explorer"
