tap "cloudflare/cloudflare"
tap "cue-lang/tap"
tap "dagger/tap"
tap "earthly/earthly"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "louisbrunner/valgrind"
tap "supabase/tap"
tap "superfly/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform make
brew "cmake"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift", link: false
# Thrift functions for querying information from a service
brew "fb303"
# Low-level cryptographic library
brew "nettle"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# HTTP and WebDAV client library with a C interface
brew "neon"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Kubernetes introspection tool for developers
brew "octant"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Rust toolchain installer
brew "rustup-init"
# Simple tool to count source lines of code
brew "sloc"
# System performance benchmark tool
brew "sysbench"
# Terminal multiplexer
brew "tmux"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared", link: false
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue"
# Terraform
brew "hashicorp/tap/terraform", link: false
brew "superfly/tap/flyctl", link: false
# Professional desktop publishing software
cask "affinity-publisher"
# Two-factor authentication software
cask "authy"
# Server and cloud storage browser
cask "cyberduck"
# Databases & SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Control your Elgato Key Lights
cask "elgato-control-center"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Organize icon sets and packs in one place
cask "iconset"
# Free and open-source media player
cask "iina"
# Kubernetes IDE
cask "lens"
# App to manage software development and track bugs
cask "linear-linear"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Minimal installer for conda
cask "miniconda"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media server
cask "plex-media-server"
# Collaboration platform for API development
cask "postman"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Remote desktop software
cask "screens-connect"
# Video game digital distribution service
cask "steam"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
mas "Core Tunnel", id: 1354318707
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
