tap "cloudflare/cloudflare"
tap "common-fate/granted"
tap "cue-lang/tap"
tap "dagger/tap"
tap "earthly/earthly"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "louisbrunner/valgrind"
tap "oven-sh/bun"
tap "supabase/tap"
tap "superfly/tap"
tap "teaxyz/pkgs"
tap "withgraphite/tap"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Arduino command-line interface
brew "arduino-cli"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Binary installation for rust projects
brew "cargo-binstall"
# Platform built on V8 to build network applications
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler2"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# Text processing system for reStructuredText
brew "docutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Compute various size metrics for a Git repository
brew "git-sizer"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# LLVM's OpenMP runtime library
brew "libomp"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# String tool
brew "intltool"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Menu-driven communications program
brew "minicom"
# Remote terminal application
brew "mosh"
# QUIC transport protocol implementation
brew "mvfst"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node@20"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Kubernetes introspection tool for developers
brew "octant"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Development kit for the Java programming language
brew "openjdk@11"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt@5"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Sigrok command-line interface to use logic analyzers and more
brew "sigrok-cli"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
brew "superfly/tap/flyctl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino-ide"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Downloads scientific computing jobs and runs them invisibly in the background
cask "boinc"
# Server and cloud storage browser
cask "cyberduck"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Remote desktop and second display tool
cask "duet"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Hex editor focussing on speed
cask "hex-fiend"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Kubernetes IDE
cask "lens"
# App to manage software development and track bugs
cask "linear-linear"
# Discover, download, and run local LLMs
cask "lm-studio"
# Window manager
cask "loop"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# VPN client
cask "mullvadvpn"
# Free and open-source RSS reader
cask "netnewswire"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Home media server
cask "plex-media-server"
# App wrapper for Postgres
cask "postgres-unofficial"
# HTTP debugging proxy
cask "proxyman"
# Geographic Information System
cask "qgis"
# Control your tools with a few keystrokes
cask "raycast"
# GUI for streamlined Redis application development
cask "redis-insight"
# Signal analysis for Saleae's devices
cask "saleae-logic"
# Remote desktop software
cask "screens-connect"
# App that enables mouse-free UI interaction
cask "shortcat"
# Video game digital distribution service
cask "steam"
# Automatic time and productivity tracking app
cask "timing"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
mas "Balatro+", id: 6502451661
mas "Core Tunnel", id: 1354318707
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sink It for Reddit", id: 6449873635
mas "Speedtest", id: 1153157709
mas "Surfshark", id: 1437809329
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dkundel.vscode-new-file"
vscode "donjayamanne.python-environment-manager"
vscode "eamodio.gitlens"
vscode "earthly.earthfile-syntax-highlighting"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "forbeslindesay.vscode-sql-template-literal"
vscode "ghmcadams.lintlens"
vscode "github.codespaces"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "inercia.vscode-k3d"
vscode "ipedrazas.kubernetes-snippets"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "mkxml.vscode-filesize"
vscode "moonrepo.moon-console"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "nicoespeon.abracadabra"
vscode "nrwl.angular-console"
vscode "ocamllabs.ocaml-platform"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ria.elastic"
vscode "rust-lang.rust-analyzer"
vscode "spikespaz.vscode-smoothtype"
vscode "statelyai.stately-vscode"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zixuanchen.vitest-explorer"
